[
    {
        "id": 200,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": true,
        "masks": [],
        "imageIds": ["65ddc2542d1e57caa5044eb3"],
        "codeId": 812,
        "abbreviation": "tpl",
        "description": "Assessment for radiolucency at a root apex representative of a pathologic process",
        "summary": "A radiolucent area has been detected at the apex of a tooth root, most likely representing a pathologic process. A pathologic periapical lucency can appear as widening of the periodontal ligament space in the apical region, loss of lamina dura at the apex, or diffuse/irregular radiolucency at the apex and should be differentiated from a benign lucency such as a chevron lucency. Differential diagnoses for periapical lucency include abscess, cyst, inflammatory disease, or other causes. Radiographic signs should be interpreted in conjunction with the oral exam. Additional views may be necessary to confirm presence of pathology. Comparison to the same tooth on the contralateral side may be useful in determining if radiographic changes represent pathology or artifact, such as chevron lucency.",
        "name": "Periapical Lucency",
        "group": "dental",
        "subgroup": "dental"
    },
    {
        "id": 201,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["65ddc2542d1e57caa5044eb3"],
        "codeId": 814,
        "abbreviation": "tfl",
        "description": "Assessment for radiolucency at the furcation of a tooth (where the tooth divides into two/three roots)",
        "summary": "A radiolucency has been detected at the furcation of the tooth indicative of loss of alveolar bone in this region. Furcation bone loss is an indicator of the presence of significant periodontal disease. Suboptimal radiographic technique and/or positioning can affect the appearance of alveolar bone. Radiographic signs should be interpreted in conjunction with the oral exam.",
        "name": "Furcation Bone Loss",
        "group": "dental",
        "subgroup": "dental"
    },
    {
        "id": 202,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["65ddc2542d1e57caa5044eb3"],
        "codeId": 815,
        "abbreviation": "tal",
        "description": "Assessment for alveolar bone loss in the horizontal and/or vertical planes",
        "summary": "Severe loss of alveolar bone has been identified in the region around a root or roots. Attachment loss is used as an indicator in staging of periodontal disease. Four red bars indicates greater than 50% loss or grade 4 periodontal disease. Two red bars indicates between 25% and 50% loss or grade 3 periodontal disease. Radiographic technique and angle can exaggerate or conceal alveolar bone loss. Radiographic signs should be interpreted in conjunction with the oral exam.",
        "name": "Severe Attachment (Alveolar Bone) loss",
        "group": "dental",
        "subgroup": "dental"
    },
    {
        "id": 203,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": true,
        "masks": [],
        "imageIds": ["65ddc2542d1e57caa5044eb3"],
        "codeId": 816,
        "abbreviation": "trl",
        "description": "Assessment for areas of decay or degradation within a tooth",
        "summary": "Presence of an area or multiple areas of decay/degradation has been identified within a tooth/teeth likely secondary to a resorptive process. Resorption often appears as irregular radiolucencies throughout the tooth. Radiolucent lesions in teeth are often attributed to primary resorptive lesions but can be representative of other disease processes such as trauma, neoplasia, inflammation/infection, caries, enamel hypoplasia, etc. Radiographic technique and angle can contribute to an abnormal appearance of the tooth. Radiographic signs should be interpreted in conjunction with the oral exam and clinical signs.",
        "name": "Resorptive Lesion",
        "group": "dental",
        "subgroup": "dental"
    },
    {
        "id": 204,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["65ddc2542d1e57caa5044eb3"],
        "codeId": 817,
        "abbreviation": "tfx",
        "description": "Assessment for fracture within the crown or root of a tooth",
        "summary": "A radiolucent line representing a fracture has been identified in the crown or root of a tooth or teeth. Fractures may be secondary to trauma or underlying pathology, or may represent worn enamel. Radiographic signs should be interpreted in conjunction with clinical history and oral exam.",
        "name": "Tooth Fracture",
        "group": "dental",
        "subgroup": "dental"
    },
    {
        "id": 205,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": true,
        "masks": [],
        "imageIds": ["65ddc2542d1e57caa5044eb3"],
        "codeId": 2157,
        "abbreviation": "trr",
        "description": "Assessment for the presence of a tooth root remnant or fragment below the gum line with little or no crown present.",
        "summary": "Retained root remnants/fragments may be found secondary to trauma, incomplete extraction, or tooth resorption. With few exceptions, retained root remnants should be extracted at the time of radiographic diagnosis. Continued retention and regular radiographic monitoring may be considered in select cases, but only if the remnant is radiographically and clinically quiet (no evidence of inflammation, infection, or other pathology), small, and known to be chronic. This test may also identify an unerupted tooth as a retained tooth root. Unerupted teeth should be extracted to prevent the development of a dentigerous cyst. Though, regular radiographic monitoring may be performed instead of extraction in older patients.",
        "name": "Retained Root(s)",
        "group": "dental",
        "subgroup": "dental"
    },
    {
        "id": 83,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["658c23084f6e5584fc05be00"],
        "codeId": 12,
        "abbreviation": "gad",
        "description": "Assessment for an overly distended stomach",
        "summary": "An abnormal test indicates distension of the stomach. Distension is evaluated based on the shape and size of the stomach and relation of the fundus to the vertebrae or ribs. Causes of stomach distension can be attributed to benign or pathologic processes. Differential diagnoses include aerophagia, post-prandial, food bloat, gastric outflow obstruction, or other causes. Radiographic signs should be interpreted along with clinical signs and physical exam findings to determine significance. \r\nDDx: Aerophagia, post-prandial, food bloat, gastric outflow obstruction, other",
        "name": "Gastric Distension",
        "group": "abdomen",
        "subgroup": "GI tract"
    },
    {
        "id": 88,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["658c23084f6e5584fc05be00"],
        "codeId": 1605,
        "abbreviation": "gmt",
        "description": "Assessment for material within the stomach which may be ingesta, foreign material, or a moderate amount of fluid",
        "summary": "An abnormal test indicates presence of material within the stomach which may be ingesta, foreign material, or a moderate amount of fluid. Radiographic signs should be interpreted along with clinical signs and physical exam findings to determine significance. Differential diagnoses may include normal ingesta (food, fluid, etc.), gastric foreign body, gastric mass, or other cause.\r\nDDx: Normal ingesta- fluid, food, etc, gastric foreign body, gastric mass, other",
        "name": "Gastric Material",
        "group": "abdomen",
        "subgroup": "GI tract"
    },
    {
        "id": 85,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["658c23084f6e5584fc05be00"],
        "codeId": 17,
        "abbreviation": "apf",
        "description": "Assessment for one or more fractures of the appendicular skeleton",
        "summary": "Interruption of the cortex is detected in an appendicular bone. Fractures may be caused by trauma or bone pathology. Additional views may be necessary to adequately assess for a fracture. \r\nDDx: Traumatic fracture, pathologic fracture, other",
        "name": "Appendicular Bone Fracture",
        "group": "musculoskeletal",
        "subgroup": "bone"
    },
    {
        "id": 87,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["658c23084f6e5584fc05be00"],
        "codeId": 723,
        "abbreviation": "abl",
        "description": "Assessment for a lytic and/or blastic bone lesion(s)",
        "summary": "Presence of a lesion within bone that is lytic and/or blastic. Summation or overlap of structures, radiographic technique, or other disease processes may affect appearance of bone. Based on clinical signs, signalment, physical exam findings, etc., further diagnostics may be necessary to diagnose neoplasia, osteomyelitis, or other cause of the suspected lesion.\r\nDDx: Neoplasia, osteomyelitis, other",
        "name": "Lytic and/or Blastic Bone Lesions",
        "group": "musculoskeletal",
        "subgroup": "bone"
    },
    {
        "id": 84,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["658c23084f6e5584fc05be00"],
        "codeId": 2158,
        "abbreviation": "van",
        "description": "Assessment for congenital anomaly affecting the vertebra(e)",
        "summary": "An abnormal test for vertebral anomaly indicates that a vertebra or vertebrae with an irregular structure has been detected. Transitional vertebrae, hemivertebrae, and block vertebrae are the most common anomalies identified and can be present in both dogs and cats, though occurrence is higher in specific breeds.\r\nDDx: Hemivertebra, transitional vertebra, block vertebrae, spina bifida, other",
        "name": "Vertebral Anomaly",
        "group": "musculoskeletal",
        "subgroup": "spine"
    },
    {
        "id": 86,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["658c23084f6e5584fc05be00"],
        "codeId": 2159,
        "abbreviation": "rfx",
        "description": "Assessment for fracture or multiple fractures of ribs",
        "summary": "Interruption of the cortex is detected in one or multiple ribs. Fractures may be caused by trauma or bone pathology. Additional views may be necessary to adequately assess for a fracture.  \r\nDDx: Traumatic fracture, healing fracture, rib lesion, other",
        "name": "Rib Fracture(s)",
        "group": "musculoskeletal",
        "subgroup": "thorax"
    },
    {
        "id": 77,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": true,
        "masks": [],
        "imageIds": ["658c23084f6e5584fc05be00"],
        "codeId": 2141,
        "abbreviation": "tms",
        "description": "Assessment for an abnormal opacity within the thorax",
        "summary": "An abnormal test for thoracic mass indicates a soft tissue opacity observed within the thorax. Masses may be homogenous, heterogenous, or mineralized; and may be of pulmonary, mediastinal, lymphatic, or musculoskeletal origin. Primary differentials include neoplasia, fungal disease, or other causes. Results of this test should be interpreted along with physical exam findings and clinical signs as well as with radiographic signs from additional views to determine a definitive diagnosis. \r\nDDx: Neoplasia, fungal, other",
        "name": "Thoracic Mass",
        "group": "thorax",
        "subgroup": "lungs"
    },
    {
        "id": 79,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["658c23084f6e5584fc05be00"],
        "codeId": 712,
        "abbreviation": "cvp",
        "description": "Assessment for an interstitial and/or alveolar pattern in the cranioventral lungs",
        "summary": "An abnormal signal correlates with the presence of an increased opacity within the cranioventral region of the lungs (right cranial lung lobe, right middle lung lobe, and/or  left cranial lung lobe) often with an interstitial and/or alveolar pattern. Lung opacity can be affected by radiographic technique, respiratory phase, obesity of the patient, and other factors. Diagnosis should be based on clinical signs, species, and physical exam findings; the primary differential diagnosis for this pattern is pneumonia, with other differentials including pulmonary hemorrhage/contusion, atelectasis, or other causes.\r\nDDx: Pneumonia, pulmonary hemorrhage, pneumonitis, neoplasia, other",
        "name": "Cranioventral Parenchymal Pattern",
        "group": "thorax",
        "subgroup": "lungs"
    },
    {
        "id": 80,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["658c23084f6e5584fc05be00"],
        "codeId": 713,
        "abbreviation": "cdp",
        "description": "Assessment for an interstitial and/or alveolar pattern in the caudodorsal lungs",
        "summary": "An abnormal test correlates with the presence of an increased opacity within the caudodorsal region of the lungs (right caudal lung lobe, accessory lung lobe, and/or left caudal lung lobe) likely representative of an interstitial and/or alveolar pattern. Lung opacity can be affected by radiographic technique, respiratory phase, obesity of the patient, and other factors. Diagnosis should be based on clinical signs, species, and physical exam findings; the primary differential diagnosis for this pattern is pulmonary edema, with other differentials including atelectasis, or other causes.\r\nDDx: Pulmonary edema, atelectasis, hemorrhage, pneumonia, neoplasia, other",
        "name": "Caudodorsal Parenchymal Pattern",
        "group": "thorax",
        "subgroup": "lungs"
    },
    {
        "id": 81,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["658c23084f6e5584fc05be00"],
        "codeId": 715,
        "abbreviation": "bpp",
        "description": "Assessment for lung changes typically associated with airway pathology",
        "summary": "An abnormal test indicates that thickening and increased opacity of bronchial walls are observed in the visible lung fields. Presence of these radiographic signs indicates inflammation of the lower airways though radiographic technique, concurrent disease, and other factors may affect appearance of the lower airways. Differential diagnoses include allergic disease, asthma, infectious or inflammatory disease, normal age related changes, or other pathologies. Further diagnostics should be determined by correlating signalment, clinical signs, and physical exam findings. \r\nDDx: Allergic/asthma/inflammatory, other",
        "name": "Bronchial Pulmonary Pattern",
        "group": "thorax",
        "subgroup": "lungs"
    },
    {
        "id": 76,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["658c23084f6e5584fc05be00"],
        "codeId": 6,
        "abbreviation": "pef",
        "description": "Assessment for fluid in the pleural space",
        "summary": "Fluid within the pleural space can be identified by prominent pleural fissure lines, retraction of lung margins from the diaphragm or chest wall, or focal accumulation of soft tissue dense opacity. Some of these findings may not be differentiated from pleural thickening or thoracic wall deformities. Primary differentials include heart failure (in cats), neoplasia, pyothorax, chylothorax, hypoproteinemia, or other causes. Additional diagnostics to consider based on clinical signs and exam findings include TFAST scan, thoracocentesis, or other advanced imaging.\r\nDDx: Heart failure (cats), neoplasia, pyothorax, hemothorax, chylothorax, hypoproteinemia, other\r\n",
        "name": "Pleural Fluid",
        "group": "thorax",
        "subgroup": "thorax"
    },
    {
        "id": 78,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["658c23084f6e5584fc05be00"],
        "codeId": 7,
        "abbreviation": "pnx",
        "description": "Assessment for air in the pleural space",
        "summary": "Evidence of air within the pleural space of the thorax is characterized by retraction of lung margins from thoracic wall, separated by a radiolucent space, displacement of the heart from the sternum, or the presence of small radiolucencies within the pleural space. An abnormal test is indicative of pneumothorax, but may also be interpreted as abnormal in cases of pneumomediastinum or subcutaneous emphysema. Thoracocentesis should only be performed based on clinical signs and exam findings.\r\nDDx: Pneumothorax, other",
        "name": "Pleural Gas",
        "group": "thorax",
        "subgroup": "thorax"
    },
    {
        "id": 82,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["658c23084f6e5584fc05be00"],
        "codeId": 2160,
        "abbreviation": "dha",
        "description": "Assessment for abdominal viscera within the thoracic cavity\r\n",
        "summary": "An abnormal test for diaphragmatic hernia indicates abdominal viscera (liver, stomach, spleen, small intestine, colon, pancreas, omentum) has been detected in the thoracic cavity. Presence of a diaphragmatic hernia may be recognized by the appearance of tubular gas filled structures in the thorax, abnormal soft tissue opacity within the thorax, enlarged cardiac silhouette with or without gas opacities, and/or incomplete diaphragm margins. \r\nDDx: Traumatic diaphragmatic hernia, peritoneal pericardial diaphragmatic hernia, hiatal hernia, other",
        "name": "Diaphragmatic Hernia",
        "group": "thorax",
        "subgroup": "thorax"
    },

    {
        "id": 8103,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["65ba48f304bb363daa0b7662", "65ba48f3ea4778b91f079520"],
        "codeId": 738,
        "abbreviation": "sfb",
        "description": "Assessment for material in the small intestine that is not consistent with the typical appearance of ingesta, gas, or fluid",
        "summary": "An abnormal finding indicates radiopaque material observed within the small intestine that is not consistent with the typical appearance of ingesta, gas, or fluid. This may represent  ingesta or may represent a foreign body, mass lesion, or other abnormality. Based on clinical signs and physical exam findings, further diagnostics such as abdominal ultrasound could be performed for definitive diagnosis.\r\nDDx: Ingesta-normal, foreign material/foreign body, mass lesion, other",
        "name": "Small Intestinal Foreign Material",
        "group": "abdomen",
        "subgroup": ""
    },
    {
        "id": 8107,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["65ba48f357cf2e1cef0793c0"],
        "codeId": 797,
        "abbreviation": "rmg",
        "description": "Assessment for enlargement of the renal silhouette",
        "summary": "An abnormal test for renomegaly suggests one or both kidneys are enlarged based on measurement comparing the length of the kidney to the length of the lumbar vertebrae. Differential diagnoses include acute kidney failure, renal compensatory hypertrophy, hydronephrosis, renal neoplasm, or other causes. Clinical signs, signalment, physical exam findings, etc. should be considered with radiographic findings to determine if further diagnostics are indicated such as bloodwork, abdominal ultrasound, etc.\r\nDDx: Acute kidney failure, renal compensatory hypertrophy, hydronephrosis, renal neoplasm, other",
        "name": "Renomegaly",
        "group": "abdomen",
        "subgroup": ""
    },
    {
        "id": 8104,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["65ba48f304bb363daa0b7662", "65ba48f3ea4778b91f079520"],
        "codeId": 14,
        "abbreviation": "sip",
        "description": "Assessment for bunching of small intestine often with abnormal intraluminal gas pattern",
        "summary": "Bunching of the small intestine, often with an abnormal intraluminal gas pattern, indicates an abnormal finding and may be indicative of small intestinal plication. Differential diagnoses for small intestinal plication include linear foreign body, enteritis, or other causes. Abdominal ultrasound may be performed for definitive diagnosis if indicated by clinical signs, physical exam, and radiographic findings. \r\nDDx: Linear foreign body, enteritis, other",
        "name": "Small Intestinal Plication",
        "group": "abdomen",
        "subgroup": "GI tract"
    },
    {
        "id": 8099,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["65ba48f3ea4778b91f079520"],
        "codeId": 1932,
        "abbreviation": "ame",
        "description": "Assessment for a well defined mass or a mass effect in the abdomen",
        "summary": "The abdominal mass effect test evaluates for displacement of organs by an abnormal radiopacity suggesting a mass within the abdominal cavity. In some instances, these findings cannot be differentiated from organomegaly. Primary differentials include neoplasia, abscess, organomegaly or other causes and further imaging such as abdominal ultrasound or CT should be considered. Additional diagnostics and definitive diagnosis should be determined based on interpretation of radiographic findings along with clinical signs, signalment, and physical exam findings.\r\nDDx: Neoplasia, abscess, granuloma, organomegaly, other",
        "name": "Abdominal Mass Effect",
        "group": "abdomen",
        "subgroup": "abdomen"
    },
    {
        "id": 8100,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["65ba48f304bb363daa0b7662", "65ba48f3ea4778b91f079520"],
        "codeId": 1933,
        "abbreviation": "lad",
        "description": "Assessment for a decrease in serosal detail or retroperitoneal detail",
        "summary": "An abnormal test may indicate decreased serosal detail in the abdomen, or decreased detail in the retroperitoneal space that may be localized or generalized. The presence of fluid, immaturity, decreased intra-abdominal fat, or radiographic technique can affect the visibility of organs within the abdomen. The primary differential diagnosis for this finding, in the absence of confounding factors, is abdominal effusion. Based on clinical signs and physical exam finding, further diagnostics should be considered including abdominal ultrasound or abdominocentesis. \r\nDDx: Abdominal effusion, emaciation, juvenile brown fat, other",
        "name": "Limited Abdominal Detail",
        "group": "abdomen",
        "subgroup": "abdomen"
    },
    {
        "id": 8108,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": true,
        "masks": [],
        "imageIds": ["65ba48f357cf2e1cef0793c0"],
        "codeId": 798,
        "abbreviation": "skd",
        "description": "Assessment for one or more pathologically small kidney(s)",
        "summary": "An abnormal test for small kidney suggests one or both kidneys are small in size based on measurement comparing the length of the kidney to the length of the lumbar vertebrae. The primary differential diagnosis is chronic kidney disease though other causes can lead to small kidneys. Clinical signs, signalment, physical exam findings, etc. should be considered with radiographic findings to determine if further diagnostics are indicated such as bloodwork, abdominal ultrasound, etc.\r\nDDx: Chronic kidney disease, other",
        "name": "Small Kidney",
        "group": "abdomen",
        "subgroup": "dental"
    },
    {
        "id": 8095,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["65ba48f304bb363daa0b7662"],
        "codeId": 20,
        "abbreviation": "hmg",
        "description": "Assessment for an enlargement of the hepatic silhouette",
        "summary": "Hepatomegaly is judged based on caudal displacement of the gastric axis, extension of the liver beyond the costal arch, and rounding of lobar margins. An abnormal test indicates that there is suspected enlargement of the liver based on the presence of one or more of the characteristics as observed in the lateral view. False positives may be seen in animals that are young, animals with deformities of the costal arch, or animals with caudal displacement of the diaphragm. An abnormal test should be interpreted along with clinical signs and physical exam findings. Primary differentials include hepatitis, hepatic lipidosis, hepatotoxicity, hepatic neoplasia, venous congestion, endocrinopathy, or other causes. Additional diagnostics such as a CBC and chemistry panel, specialized liver profiles, abdominal ultrasound, fine needle aspirate or biopsy may be necessary for definitive diagnosis.\r\nDDx: Hepatitis, hepatic lipidosis, hepatotoxicity, hepatic neoplasia, venous congestion, endocrinopathy, other",
        "name": "Hepatomegaly",
        "group": "abdomen",
        "subgroup": "liver"
    },
    {
        "id": 8092,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["65ba48f304bb363daa0b7662", "65ba48f3ea4778b91f079520"],
        "codeId": 11,
        "abbreviation": "ubc",
        "description": "Assessment for mineral within the urinary bladder silhouette",
        "summary": "An abnormal test indicates that an abnormal/mineral opacity has been detected over the outline of the bladder. The most likely diagnosis being urolithiasis, other causes can be ruled out with additional diagnostics such as additional radiographic images, contrast study, abdominal ultrasound, etc.\r\nDDx: Urolithiasis, other",
        "name": "Urinary Bladder Calculi",
        "group": "abdomen",
        "subgroup": "urinary"
    },
    {
        "id": 8096,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["65ba48f304bb363daa0b7662", "65ba48f357cf2e1cef0793c0"],
        "codeId": 699,
        "abbreviation": "rmn",
        "description": "Assessment for mineralization of one or both kidneys",
        "summary": "An abnormal test indicates mineral opacity observed within one or both kidneys. Multiple radiographic views or abdominal ultrasound may be necessary to definitively determine if the mineral is within the kidney versus overlying intestine or other structures. Primary differential diagnoses include nephroliths, dystrophic mineralization, or other causes.\r\nDDx: Nephroliths, dystrophic mineralization, other",
        "name": "Renal Mineralization",
        "group": "abdomen",
        "subgroup": "urinary"
    },
    {
        "id": 8097,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": [
            "65ba48f304bb363daa0b7662",
            "65ba48f357cf2e1cef0793c0",
            "65ba48f3ea4778b91f079520"
        ],
        "codeId": 2158,
        "abbreviation": "van",
        "description": "Assessment for congenital anomaly affecting the vertebra(e)",
        "summary": "An abnormal test for vertebral anomaly indicates that a vertebra or vertebrae with an irregular structure has been detected. Transitional vertebrae, hemivertebrae, and block vertebrae are the most common anomalies identified and can be present in both dogs and cats, though occurrence is higher in specific breeds.\r\nDDx: Hemivertebra, transitional vertebra, block vertebrae, spina bifida, other",
        "name": "Vertebral Anomaly",
        "group": "musculoskeletal",
        "subgroup": ""
    },
    {
        "id": 8102,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["65ba48f357cf2e1cef0793c0"],
        "codeId": 2159,
        "abbreviation": "rfx",
        "description": "Assessment for fracture or multiple fractures of ribs",
        "summary": "Interruption of the cortex is detected in one or multiple ribs. Fractures may be caused by trauma or bone pathology. Additional views may be necessary to adequately assess for a fracture.  \r\nDDx: Traumatic fracture, healing fracture, rib lesion, other",
        "name": "Rib Fracture(s)",
        "group": "musculoskeletal",
        "subgroup": ""
    },
    {
        "id": 8105,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": [
            "65ba48f304bb363daa0b7662",
            "65ba48f357cf2e1cef0793c0",
            "65ba48f3ea4778b91f079520"
        ],
        "codeId": 723,
        "abbreviation": "abl",
        "description": "Assessment for a lytic and/or blastic bone lesion(s)",
        "summary": "Presence of a lesion within bone that is lytic and/or blastic. Summation or overlap of structures, radiographic technique, or other disease processes may affect appearance of bone. Based on clinical signs, signalment, physical exam findings, etc., further diagnostics may be necessary to diagnose neoplasia, osteomyelitis, or other cause of the suspected lesion.\r\nDDx: Neoplasia, osteomyelitis, other",
        "name": "Lytic and/or Blastic Bone Lesions",
        "group": "musculoskeletal",
        "subgroup": "GI tract"
    },
    {
        "id": 8101,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": [
            "65ba48f304bb363daa0b7662",
            "65ba48f357cf2e1cef0793c0",
            "65ba48f3ea4778b91f079520"
        ],
        "codeId": 17,
        "abbreviation": "apf",
        "description": "Assessment for one or more fractures of the appendicular skeleton",
        "summary": "Interruption of the cortex is detected in an appendicular bone. Fractures may be caused by trauma or bone pathology. Additional views may be necessary to adequately assess for a fracture. \r\nDDx: Traumatic fracture, pathologic fracture, other",
        "name": "Appendicular Bone Fracture",
        "group": "musculoskeletal",
        "subgroup": "bone"
    },
    {
        "id": 8083,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["65ba48f304bb363daa0b7662", "65ba48f3ea4778b91f079520"],
        "codeId": 9,
        "abbreviation": "SPN",
        "description": "Assessment for bony bridging across intervertebral disc spaces",
        "summary": "An abnormal test for spondylosis indicates that bony bridging across intervertebral disc spaces has been detected in a lateral projection. Spondylosis deformans is considered a noninflammatory degenerative disorder, typically of no clinical significance. Differential diagnoses include chronic IVDD, age related changes, or other causes. \r\nDDx: Chronic IVDD, age-related, other",
        "name": "Spondylosis",
        "group": "musculoskeletal",
        "subgroup": "spine"
    },
    {
        "id": 8090,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": [
            "65ba48f304bb363daa0b7662",
            "65ba48f357cf2e1cef0793c0",
            "65ba48f3ea4778b91f079520"
        ],
        "codeId": 2160,
        "abbreviation": "dha",
        "description": "Assessment for abdominal viscera within the thoracic cavity\r\n",
        "summary": "An abnormal test for diaphragmatic hernia indicates abdominal viscera (liver, stomach, spleen, small intestine, colon, pancreas, omentum) has been detected in the thoracic cavity. Presence of a diaphragmatic hernia may be recognized by the appearance of tubular gas filled structures in the thorax, abnormal soft tissue opacity within the thorax, enlarged cardiac silhouette with or without gas opacities, and/or incomplete diaphragm margins. \r\nDDx: Traumatic diaphragmatic hernia, peritoneal pericardial diaphragmatic hernia, hiatal hernia, other",
        "name": "Diaphragmatic Hernia",
        "group": "thorax",
        "subgroup": ""
    },
    {
        "id": 8109,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["65ba48f304bb363daa0b7662", "65ba48f3ea4778b91f079520"],
        "codeId": 799,
        "abbreviation": "esd",
        "description": "Assessment for distension of the esophagus",
        "summary": "The esophagus is assessed on the lateral view, with a normal esophagus being difficult to visualize, and abnormal distension characterized by visualization of a soft tissue band representative of the esophageal wall. The esophagus may be distended or dilated with fluid, gas, or material that may represent ingesta or foreign matter. Distension can be generalized or segmented. Causes may include aerophagia, megaesophagus, esophagitis, foreign body, or other pathologies. Interpreted along with clinical signs, additional diagnostics may be considered such as endoscopy or contrast study. \r\nDDx: Aerophagia, megaesophagus, esophagitis, foreign body, other",
        "name": "Esophageal Distension",
        "group": "thorax",
        "subgroup": "dental"
    },
    {
        "id": 8091,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [
            {
                "svg": "M1981.52156,2032.13323l21.22936,24.29429l29.16482,18.56474l34.22611,10.62643l60.90248,1.28012l68.13938,-13.70992l50.22475,-16.31053l49.33858,-24.56044l33.98603,-24.31892l33.13447,-37.4648l14.36852,-21.91617l24.89399,-54.22305l10.5738,-37.25282l1.10201,-61.29528l-4.93905,-25.18725l-15.63074,-40.27765l-29.31153,-48.30649l-34.79311,-24.97248l-35.47987,-18.89447l-36.55284,-7.01947l-64.20546,-5.16055l-17.07694,1.7826l-26.27943,8.38454l-28.61264,15.36723l-22.84874,17.5126l-24.92771,24.64963l-49.94245,71.96364l-28.12173,52.06406l-22.07585,57.16292l-10.74627,54.25941l-1.20128,51.26769l8.68654,31.02591l12.77482,20.66447z",
                "imageId": "65ba48f304bb363daa0b7662"
            }
        ],
        "imageIds": ["65ba48f304bb363daa0b7662"],
        "codeId": 947,
        "abbreviation": "vhs",
        "description": "Measurement of heart size based on comparison of cardiac silhouette dimensions against thoracic vertebral body length",
        "summary": "An abnormal VHS test suggests enlargement of cardiac size based on measurement of the axes of the heart compared against the thoracic vertebrae. It is important to note that rotation, breed, right or left lateral recumbency, respiratory phase, along with other factors can affect measurements. Interpreted along with clinical signs and physical exam findings, differentials for cardiomegaly may include cardiomyopathy, valvular disease, pericardial disease, congenital disease, or other pathology. Further testing including echocardiography and electrocardiogram should be considered for definitive diagnosis. \r\nDDx: Cardiomyopathy, valvular disease, pericardial disease, congenital, other",
        "name": "Vertebral Heart Score",
        "group": "thorax",
        "subgroup": "heart",
        "color": "rgba(0, 160, 210, 0.7)",
        "vhs": 7.3
    },
    {
        "id": 8087,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["65ba48f304bb363daa0b7662"],
        "codeId": 712,
        "abbreviation": "cvp",
        "description": "Assessment for an interstitial and/or alveolar pattern in the cranioventral lungs",
        "summary": "An abnormal signal correlates with the presence of an increased opacity within the cranioventral region of the lungs (right cranial lung lobe, right middle lung lobe, and/or  left cranial lung lobe) often with an interstitial and/or alveolar pattern. Lung opacity can be affected by radiographic technique, respiratory phase, obesity of the patient, and other factors. Diagnosis should be based on clinical signs, species, and physical exam findings; the primary differential diagnosis for this pattern is pneumonia, with other differentials including pulmonary hemorrhage/contusion, atelectasis, or other causes.\r\nDDx: Pneumonia, pulmonary hemorrhage, pneumonitis, neoplasia, other",
        "name": "Cranioventral Parenchymal Pattern",
        "group": "thorax",
        "subgroup": "lungs"
    },
    {
        "id": 8088,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": [
            "65ba48f304bb363daa0b7662",
            "65ba48f357cf2e1cef0793c0",
            "65ba48f3ea4778b91f079520"
        ],
        "codeId": 713,
        "abbreviation": "cdp",
        "description": "Assessment for an interstitial and/or alveolar pattern in the caudodorsal lungs",
        "summary": "An abnormal test correlates with the presence of an increased opacity within the caudodorsal region of the lungs (right caudal lung lobe, accessory lung lobe, and/or left caudal lung lobe) likely representative of an interstitial and/or alveolar pattern. Lung opacity can be affected by radiographic technique, respiratory phase, obesity of the patient, and other factors. Diagnosis should be based on clinical signs, species, and physical exam findings; the primary differential diagnosis for this pattern is pulmonary edema, with other differentials including atelectasis, or other causes.\r\nDDx: Pulmonary edema, atelectasis, hemorrhage, pneumonia, neoplasia, other",
        "name": "Caudodorsal Parenchymal Pattern",
        "group": "thorax",
        "subgroup": "lungs"
    },
    {
        "id": 8085,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["65ba48f357cf2e1cef0793c0", "65ba48f3ea4778b91f079520"],
        "codeId": 2141,
        "abbreviation": "tms",
        "description": "Assessment for an abnormal opacity within the thorax",
        "summary": "An abnormal test for thoracic mass indicates a soft tissue opacity observed within the thorax. Masses may be homogenous, heterogenous, or mineralized; and may be of pulmonary, mediastinal, lymphatic, or musculoskeletal origin. Primary differentials include neoplasia, fungal disease, or other causes. Results of this test should be interpreted along with physical exam findings and clinical signs as well as with radiographic signs from additional views to determine a definitive diagnosis. \r\nDDx: Neoplasia, fungal, other",
        "name": "Thoracic Mass",
        "group": "thorax",
        "subgroup": "spine"
    },
    {
        "id": 8084,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": [
            "65ba48f304bb363daa0b7662",
            "65ba48f357cf2e1cef0793c0",
            "65ba48f3ea4778b91f079520"
        ],
        "codeId": 6,
        "abbreviation": "pef",
        "description": "Assessment for fluid in the pleural space",
        "summary": "Fluid within the pleural space can be identified by prominent pleural fissure lines, retraction of lung margins from the diaphragm or chest wall, or focal accumulation of soft tissue dense opacity. Some of these findings may not be differentiated from pleural thickening or thoracic wall deformities. Primary differentials include heart failure (in cats), neoplasia, pyothorax, chylothorax, hypoproteinemia, or other causes. Additional diagnostics to consider based on clinical signs and exam findings include TFAST scan, thoracocentesis, or other advanced imaging.\r\nDDx: Heart failure (cats), neoplasia, pyothorax, hemothorax, chylothorax, hypoproteinemia, other\r\n",
        "name": "Pleural Fluid",
        "group": "thorax",
        "subgroup": "thorax"
    },
    {
        "id": 8086,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": [
            "65ba48f304bb363daa0b7662",
            "65ba48f357cf2e1cef0793c0",
            "65ba48f3ea4778b91f079520"
        ],
        "codeId": 7,
        "abbreviation": "pnx",
        "description": "Assessment for air in the pleural space",
        "summary": "Evidence of air within the pleural space of the thorax is characterized by retraction of lung margins from thoracic wall, separated by a radiolucent space, displacement of the heart from the sternum, or the presence of small radiolucencies within the pleural space. An abnormal test is indicative of pneumothorax, but may also be interpreted as abnormal in cases of pneumomediastinum or subcutaneous emphysema. Thoracocentesis should only be performed based on clinical signs and exam findings.\r\nDDx: Pneumothorax, other",
        "name": "Pleural Gas",
        "group": "thorax",
        "subgroup": "thorax"
    },
    {
        "id": 8110,
        "isNormal": true,
        "isAbnormal": false,
        "isLikely": false,
        "masks": [],
        "imageIds": ["65ba48f304bb363daa0b7662", "65ba48f3ea4778b91f079520"],
        "codeId": 733,
        "abbreviation": "efb",
        "description": "Assessment for foreign material in the esophagus",
        "summary": "An abnormal test for esophageal foreign body indicates that an abnormal opacity has been identified within the esophagus or overlying the esophageal region. Interpreted together with clinical signs, additional diagnostics should be considered such as endoscopy or contrast study. \r\nDDx: Esophageal foreign body, other",
        "name": "Esophageal Foreign Body",
        "group": "thorax",
        "subgroup": "urinary"
    }
]
